{"class_name": "Sequential", "keras_version": "2.0.5", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"unroll": false, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "kernel_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "batch_input_shape": [null, 1, 17], "return_sequences": true, "recurrent_constraint": null, "units": 512, "activity_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "lstm_1", "kernel_regularizer": null, "implementation": 0, "return_state": false, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_constraint": null, "units": 512, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "lstm_2", "kernel_regularizer": null, "implementation": 0, "return_state": false, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "units": 17, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}