{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.5", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 20, 330], "dtype": "float32", "unit_forget_bias": true, "implementation": 0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "return_sequences": true, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "name": "lstm_1", "return_state": false, "kernel_constraint": null, "unroll": false, "activation": "tanh", "stateful": false, "dropout": 0.0, "units": 512, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_constraint": null, "implementation": 0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "return_sequences": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_regularizer": null, "dropout": 0.0, "kernel_regularizer": null, "name": "lstm_2", "return_state": false, "kernel_constraint": null, "unroll": false, "activation": "tanh", "stateful": false, "recurrent_dropout": 0.0, "units": 512, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 330, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}]}